Repository: Elth1s/Marketplace
Catalog: WebAPI/Resources/ErrorMessages.*.resx
Languages: uk

# CategoryNotFound
source: Category was not found
uk: Категорія не знайдена

# CharacteristicGroupNotFound
source: Characteristic group was not found
uk: Група характеристик не знайдена

# CharacteristicNameNotFound
source: Characteristic name was not found
uk: Назва характеристики не знайдена

# ExternalLoginAddFail
source: Failed to add external login
uk: Не вдалося додати зовнішній логін

source: Invalid external login request
uk: Недійсний зовнішній запит на вхід

# CaptchaVerificationFailed
source: You have not passed the captcha verification
uk: Ви не пройшли перевірку captcha

# CityNotFound
source: City was not found
uk: Місто не знайдено

# CountryNotFound
source: County was not found
uk: Країна не знайдена

# InvalidToken
source: Invalid refresh token
uk: Невірний тонен оновлення

# InvalidUserData
source: User with entered data not found
uk: Користувач із введеними даними не знайдений

# ShopNotFound
source: Shop was not found
uk: Магазин не знайдено

# TokenRevorked
source: Token already revoked
uk: Токен уже відкликано

# UserCreateFail
source: User creation failed
uk: Помилка при створенні користувача

# UsernameAlreadyExists
source: User with this user name already exist
uk: Користувач із таким іменем уже існує

# UserNotFound
source: User was not found
uk: Користувача не знайдено

# FilterGroupNotFound
source: Filter group was not found
uk: Група фільтрів не знайдена

# FilterNameNotFound
source: Filter name was not found
uk: Назва фільтра не знайдена

# ProductStatusNotFound
source: Product Status was not found
uk: Статус продукту не знайдено

# ProductNotFound
source: Product was not found
uk: Продукт не знайдено

# ProductCharacteristicNotFound
source: Product Characteristic was not found
uk: Характеристика продукту не знайдена

# ProductImageNotFound
source: Product Image was not found
uk: Зображення продукту не знайдено

# UserAddRoleFail
source: Failed to add seller role
uk: Не вдалося додати роль продавця

# AlreadyComfirmEmail
source: Your email address has already been confirmed
uk: Ваша електронна адреса вже підтверджена

# EmailSendingFailed
source: Sending email failed
uk: Не вдалося надіслати електронний лист

# InvalidConfirmToken
source: Invalid confirmation token
uk: Недійсний токен підтвердження

source: Invalid password
uk: Невірний пароль

# InvalidResetPasswordToken
source: Invalid password reset token
uk: Невірний токен для скидання пароля

# PasswordUpdateFail
source: Updating password failed
uk: Не вдалося оновити пароль

# FilterValueNotFound
source: Filter value was not found
uk: Значення фільтра не знайдено

# UnitNotFound
source: Unit was not found
uk: Одиницю виміру не знайдено

# FilterNameUnitNotUnique
source: Filter name with this unit measure already exists
uk: Назва фільтра з цією одиницею вимірювання вже існує

# CityCountryNotUnique
source: City with this country already exists
uk: Місто з цією країною вже існує

# CharacteristicValueNotFound
source: Characteristic value was not found
uk: Значення характеристики не знайдено

# AlreadyComfirmPhone
source: Your phone number has already been confirmed
uk: Ваш номер телефону вже підтверджено

source: Basket item not found
uk: Товар в кошику не знайдено

# PasswordExist
source: Password is already exist
uk: Пароль вже існує

# AddPasswordFailed
source: Adding password failed
uk: Не вдалося додати пароль

# CountryWithCodeExist
source: Country with this code already exist
uk: Країна з таким кодом вже існує

# CategoryNameNotUnique
source: Category with this name already exist
uk: Категорія з такою назвою вже існує

# CategoryUrlSlugNotUnique
source: Category with this url slug already exist
uk: Категорія з цією веб-адресою вже існує

source: Order not found
uk: Замовлення не знайдено

source: Order status not found
uk: Статус замовлення не знайдено

source: Review image not found
uk: Зображення відгуку не знайдено

source: Review not found
uk: Відгук не знайдено

# InvalidUserEmail
source: Invalid email
uk: Невірна email-адреса

# ReviewOrder
source: You need order product to write review
uk: Вам необхідно замовити товар, щоб написати відгук

source: Question not found
uk: Питання не знайдено

source: Question image not found
uk: Зображення запитання не знайдено

# CharacteristicGroupExist
source: Characteristic group with name already exist
uk: Група характеристик з такою назвою вже існує

# CharacteristicValueExist
source: Characteristic value with this name already exist
uk: Значення характеристики вже існує

# CharacteristicNameExist
source: Characteristic name with this group and unit already exist
uk: Назва характеристики вже існує
