Repository: Elth1s/Marketplace
Catalog: WebAPI/Resources/ValidationResourсes.*.resx
Languages: uk

# AdvantagesPropName
source: Advantages
uk: Переваги

# CategoryUrlSlugPropName
source: Category url slug
uk: Веб-адреса категорії

# CodeExactLengthMessage
source: Code must be 2 characters long
uk: Код має бути довжиною 2 символи

# CodePropName
source: Code
uk: Код

# CommentMaxLengthPropName
source: Comment
uk: Коментаря

# CommentPropName
source: Comment
uk: Коментар

# ConfirmationCodePropName
source: Confirmation code
uk: Код підтвердження

# ConfirmPasswordPropName
source: Confirm Password
uk: Підтвердьте пароль

# ContainDigitMessage
source: {PropertyName} must contain at least one digit
uk: {PropertyName} має містити принаймні одну цифру

# ContainLowercaseMessage
source: {PropertyName} must contain at least one lowercase letter
uk: {PropertyName} має містити принаймні одну малу літеру

# ContainSpecialCharacterMessage
source: {PropertyName} must contain at least one special character
uk: {PropertyName} має містити принаймні один спеціальний символ

# ContainUppercaseMessage
source: {PropertyName} must contain at least one uppercase letter
uk: {PropertyName} має містити принаймні одну велику літеру

# CountPropName
source: Count
uk: Кількість

# DateEndPropName
source: End date
uk: Дата закінчення

# DateStartPropName
source: Start date
uk: Дата початку

# DescriptionNameProp
source: Description
uk: Опис

# DisadvantagesPropName
source: Disadvantages
uk: Недоліки

# DiscountMaxPropName
source: Maximum discount
uk: Максимальна знижка

# DiscountMinPropName
source: Minimum discount
uk: Мінімальна знижка

# EmailAddressPropName
source: Email address
uk: Email-адреса

# EmailOrPhonePropName
source: Email address or phone number
uk: Email-адреса або номер телефону

# EnglishMeasurePropName
source: English Measure
uk: Міра англійською

# EnglishNamePropName
source: English name
uk: Назва англійською

# FilterGroupUniqueNameMessage
source: Filter group with this name already exists
uk: Група фільтрів з таким ім'ям вже існує

# FirstNamePropName
source: First name
uk: Ім'я

# FullNamePropName
source: Full name
uk: Прізвище та ім'я

# GreaterThanMessage
source: {PropertyName} must be greater than {ComparisonValue}
uk: {PropertyName} має бути більшою за {ComparisonValue}

# InformationRelevanceRatingPropName
source: Information relevance rating
uk: Рейтинг актуальності інформації

# InvalidFormatMessage
source: {PropertyName} is not in the correct format
uk: {PropertyName} має неправильний формат

# MessagePropName
source: Message
uk: Повідомлення

# NamePropName
source: Name
uk: Ім'я

# OldPasswordPropName
source: Old password
uk: Старий пароль

# OrderByPropName
source: Order by
uk: Сортувати по

# OrderStatusUniqueNameMessage
source: Order status with this name already exists
uk: Статус замовлення з таким ім'ям вже існує

# PagePropName
source: Page
uk: Сторінка

# PasswordConfrimPasswordEqualMessage
source: Password and confirm password do not match
uk: Пароль та підтвердьте пароль не співпадають

# PasswordMinLengthMessage
source: The length of passsord must be at least {MinLength} characters
uk: Довжина паролю має бути не меншою ніж {MinLength} символів

# PasswordPropName
source: Password
uk: Пароль

# PhonePropName
source: Phone number
uk: Номер телефону

# PluralGreaterThanMessage
source: {PropertyName} must be greater than {ComparisonValue}
uk: {PropertyName} мають бути більшими за {ComparisonValue}

# PluralLengthMessage
source: The length of {PropertyName} must be at least {MinLength} characters
uk: {PropertyName} мають бути довжиною від {MinLength} до {MaxLength} символів

# PluralRequiredMessage
source: {PropertyName} is required
uk: {PropertyName} є обов'язковими

# PriceNameProp
source: Price
uk: Ціна

# ProductRatingPropName
source: Product rating
uk: Рейтинг продукта

# ProductStatusUniquesNameMessage
source: Product status with this name already exists
uk: Статус продукта з таким ім'ям вже існує

# ProductUrlSlugPropName
source: Product url slug
uk: Веб-адреса продукта

# RequiredMessage
source: {PropertyName} is required
uk: {PropertyName} є обов'язковою

# RowsPerPagePropName
source: Rows per page
uk: Рядкі на сторінці

# SecondNamePropName
source: Second name
uk: Прізвище

# ServiceQualityRatingPropName
source: Service quality rating
uk: Рейтинг якості обслуговування

# ShopUniqueEmailMessage
source: Shop with this email address already exists
uk: Магазин із цією електронною адресою вже існує

# ShopUniqueSiteURLMessage
source: Shop with this site URL already exists
uk: Магазин із такою веб-адресою сайту вже існує

# SiteURLPropName
source: Site URL
uk: Веб-адреса сайту

# TextPropName
source: Text
uk: Текст

# TimelinessRatingPropName
source: Timeliness rating
uk: Рейтинг дотримання термінів

# TokenPropName
source: Token
uk: Токен

# UkrainianMeasurePropName
source: Ukrainian Measure
uk: Міра українською

# UkrainianNamePropName
source: Ukrainian name
uk: Назва українською

# UserUniqueEmailMessage
source: User with this email already exists
uk: Користувач із цією email-адресою вже існує

# UserUniquePhoneMessage
source: User with this phone number already exists
uk: Користувач із таким номером телефону вже існує

# ValuePropName
source: Value
uk: Значення
